Revit 2024 API
SystemsAnalysisOptions.WeatherFile Property
 The file name of the EnergyPlus weather (*.epw).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public string WeatherFile { get; set; }
Visual Basic
Public Property WeatherFile As String
	Get
	Set
Visual C++
public:
property String^ WeatherFile {
	String^ get ();
	void set (String^ value);
}
Remarks
 When requesting a new system analysis, it is okay to have an empty weather file in the SystemsAnalysisOption. In that case, the ViewSystemsAnalysisReport would use the weather file at the current site location.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The analysis requires a valid EnergyPlus weather (.epw) file.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
SystemsAnalysisOptions Class
Autodesk.Revit.DB.Analysis Namespace